let data = [
  "Засгийн",
  "газарт",
  "6.4",
  "сая",
  "тонн",
  "нүүрс",
  "алдагдсан",
  "гэх",
  "мэдээлэл",
  "ирээгүй",
  "байна.",
  "Бодит",
  "байдалд",
  "ийм",
  "их",
  "хэмжээний",
  "нүүрс",
  "алдагдсан",
  "гэх",
  "асуудал",
  "эргэлзээтэй",
  "байна.",
  "Хууль",
  "хяналтын",
  "байгууллага",
  "хяналт",
  "шалгалтын",
  "ажил",
  "явуулж",
  "байна",
];
let input = prompt("Хайх үгээ оруулна уу.");
let count = 0;
for (let i = 0; i < data.length; i++) {
  if (input.toUpperCase() == data[i].toUpperCase()) {
    count++;
  }
}
if (count > 0) {
  alert(`${input} - гэх үг ${count} ширхэг байна.`);
} else {
  alert(`Таны хайсан үг байхгүй байна.`);
}
